cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'motemen/ghq'
tap 'tkengo/highway'

brew 'readline'
brew 'texinfo' # brew link --force texinfo (for Emacs flycheck)

brew 'coreutils'
brew 'curl'
brew 'git'
brew 'wget'
brew 'watch'
brew 'bash'
brew 'zsh', args: ['without-etcdir']
brew 'direnv'

brew 'go'
brew 'nodebrew'
brew 'rbenv'
brew 'rbenv-gemset'
brew 'ruby-build'
brew 'multirust'

# brew 'homebrew/versions/mysql56'
# brew 'mysql'
# brew 'redis'

brew 'docker-machine'
brew 'docker-compose'

brew 'ag'
brew 'emacs', args: ['with-cocoa', 'with-gnutls'] # brew linkapps emacs
brew 'fzf', args: ['HEAD']
brew 'ghq'
brew 'highway'
brew 'htop'
brew 'jq'
brew 'tig'
brew 'tmux'
brew 'https://raw.githubusercontent.com/sorah/envchain/master/brew/envchain.rb'

# cask
cask 'appcleaner'
cask 'atom'
cask 'caffeine'
cask 'copy'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'ifunbox'
cask 'iterm2'
cask 'karabiner'
cask 'keepassx'
cask 'kindle'
cask 'skype'
cask 'slate'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'wireshark'
cask 'xquartz'
