tap 'homebrew/bundle'
tap 'caskroom/cask'

brew 'readline'
brew 'openssl'
brew 'texinfo' # brew link --force texinfo (for Emacs flycheck)

brew 'zsh', args: ['without-etcdir']
brew 'coreutils'
brew 'curl'
brew 'wget'
brew 'git'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-gemset'
brew 'rbenv-gem-rehash'
brew 'go'
brew 'nodebrew'

brew 'mysql'
# brew 'redis'

brew 'fzf', args: ['HEAD']
brew 'ag'
brew 'tig'
brew 'jq'
brew 'htop'
brew 'tmux'
brew 'emacs', args: ['with-cocoa', 'with-gnutls'] # brew linkapps emacs

# cask
cask 'xquartz'
cask 'keepassx'
cask 'copy'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'karabiner'
cask 'slate'
cask 'atom'
cask 'caffeine'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'hipchat'
cask 'skype'
cask 'ifunbox'
cask 'wireshark'
cask 'iterm2'
cask 'appcleaner'
cask 'kindle'
